[
  {
    "id": 1,
    "name": "Stade Ibn Batouta",
    "image": "http://stadiumdb.com/pictures/stadiums/mar/grand_stade_de_tanger/grand_stade_de_tanger19.jpg",
    "location": "Tangier",
    "description": "Stade Ibn Batouta is a football stadium in Tangier, Morocco.",
    "capacity": 65000,
    "opened": "2011",
    "country": "Morocco",
    "details": "The newly built stadium in south-western outskirts of Tangier (by the N1 national road) isn't only the city's largest sports facility, but the largest building overall. Construction was marred with delays and lasted almost 9 years in the end. Began in 2002, it wasn't delivered until 2011. And it may still seem look unfinished to some, not without purpose. Both end zones were left single-tiered, but with the footing for an upper tier to be added in the future. Similarly, the east stand already has support structures for its future roof, should funds be allocated to build one. While a lot may still be done, the initial budget of 844 million dirhams seems a very modest one by global standards for a 45,000-seat stadium. Unfortunately, price seems to match quality in some areas. Open ends create strong drafts, western roof covers barely anyone in the lower tier, while the playing field is very far from fans. Further criticism was caused by insufficient access in early years of the stadium. Largest events cause severe congestion both in terms of traffic and turnstile crowds. The latter was reported to lead to potentially dangerous situations. Despite all concerns, the stadium will remain Tangier's major sports venue. It was opened by a friendly tournament by Atletico Madrid, Raja Casablanca, and Ittihad. Everyday use is provided by Ittihad, who struggle to fill the ground half-way. Largest crowds gather in the southern curve, where fanatic supporters cheer for their team. Between 2020 and 2023, the stands on the arches were extended to equal the height of those along the pitch. The upgrade increased the capacity of the stadium by up to 20,000 seats to 65,000 spectators. The additional sections were ready for the FIFA Club World Cup to be played in February 2023."
  },
  {
    "id": 2,
    "name": "Stade Prince Moulay Abdellah",
    "image": "http://stadiumdb.com/pictures/historical/mar/stade_moulay_abdellah/stade_moulay_abdellah11.jpg",
    "location": "Rabat",
    "description": "Stade Prince Moulay Abdellah is a stadium in Rabat, Morocco.",
    "capacity": 52000,
    "opened": "1983",
    "country": "Morocco",
    "details": "Rabat's largest stadium was built in the south-western outskirts of the city in 1983. It never received any major redevelopments but was thoroughly renovated in 2001, receiving individual seats, many of which were later ripped out. Apart from hosting games by FAR and Fath Rabat, it is also one of the homes for the Morocco national team and played host to 1988 CAN matches. It was also proposed to hold 2006 and 2010 World Cup games when Morocco attempted to become the first-ever African hosts."
  },
  {
    "id": 3,
    "name": "Stade Marrakech",
    "image": "http://stadiumdb.com/pictures/stadiums/mar/stade_de_marrakech/stade_de_marrakech14.jpg",
    "location": "Marrakech",
    "description": "Stade Marrakech is a stadium in Marrakech, Morocco.",
    "capacity": 45240,
    "opened": "2011",
    "country": "Morocco",
    "details": "Built some 11km from the centre of Marrakech, this stadium stands in a rather deserted area. With few landmarks around, it seems almost like an ancient fort, and that's not a coincidence. The form was supposed to refer to fortifications on one hand and to local architecture in general. That's why massive elements dominate, geometrical forms give it rhythm, and the colors are all natural, from white to brown. The vision of the Moroccan-Italian design team was criticized, however, for the resemblance this ground has to Stadio Luigi Ferraris created by the same architects in Italy. Marrakech Stadium was opened in January 2011 after a stunning period of over 7 years under construction. Initially, it was planned to be opened long before that date. But since it's finally opened, many events started coming to the city, to name just the national teams clashes. The major day-to-day tenant is Kawkab, a local football team that hardly draws crowds of the stadium's size. And the size literally is huge as fans are situated extremely far from the pitch. Not only do they sit behind the athletics track and significant warm-up space and a deep moat, many seats are even further than in other venues because this stadium has a rectangular shape instead of elliptical. This is why seats around corners are almost always empty."
  },
  {
    "id": 4,
    "name": "Stade Adrar",
    "image": "http://stadiumdb.com/pictures/stadiums/mar/grand_stade_agadir/grand_stade_agadir04.jpg",
    "location": "Agadir",
    "description": "Stade Adrar is a stadium in Agadir, Morocco.",
    "capacity": 45480,
    "opened": "2013",
    "country": "Morocco",
    "details": "The competition for the design of a new major stadium in Agadir was launched back in the twentieth century when Morocco was bidding to become the first-ever African host of the FIFA World Cup. The Italian-Moroccan consortium of Gregotti and Benkirane was awarded the job. That same design, though upgraded, was submitted as Morocco's bid for the 2010 World Cup, having failed for the 2006 edition. Ground clearing began in 2003. FIFA chose South Africa over Morocco in May 2004 by 14 votes to 10, effectively ruining Morocco's chances for at least two decades. Construction was officially launched just weeks after FIFA's decision, in June 2004. Financing didn't last long, and it came to a halt until 2007. Restarted in 2007, by 2009 the build was nearing completion when it was stopped again. It wasn't until Morocco was granted the hosting of the 2013 Club World Cup that the project was back on track. It ended up with a budget of 860 million dirhams (roughly €80m / $90m). The stadium has 45,000 seats and achieved this with minimalized construction cost. Part of the stadium is sunken, and the land excavated to hold the bowl was used to form embankments. Shaded routes encircle the ground, while the cheaper method proved a fine option in terms of seismic resistance. Aesthetically, the stadium seems well fitted for its location, mimicking the surrounding hills in shape and natural coloring. The sloped elevations are cladded with stone. Popular club Hassania are nominal hosts of the stadium, but already on opening day, it was confirmed this would be an international venue as it hosted the Morocco – South Africa friendly. Soon afterward, the first international event took place: key matches of the FIFA Club World Cup."
  },
  {
    "id": 5,
    "name": "Fez Stadium",
    "image": "http://stadiumdb.com/pictures/stadiums/mar/complexe_sportif_de_fes/complexe_sportif_de_fes02.jpg",
    "location": "Fez",
    "description": "Fez Sports complex is a stadium in Fez, Morocco.",
    "capacity": 45000,
    "opened": "2007",
    "country": "Morocco",
    "details": "According to initial plans, works on the new central stadium for Fez were to start in the early 1990s, but groundbreaking was delayed for almost 2 years, starting eventually in 1994. The delays were growing further as time went by, resulting in the stadium not being ready for the 1997 Cup of Nations, as was planned. It wasn't until 2003 that the construction ended, being expanded in the process by 5,000 additional seats compared to the 1992 design. Even after delivery, it waited four years to be opened. The free-for-all exhibition game between FAR Rabat and Rachad Bernoussi was played in front of full stands in November 2007. Since then, the top-tier club Maghreb has been the main tenant, accompanied by another premier league side Wydad, occasionally also by the national team of Morocco."
  },
  {
    "id": 6,
    "name": "Grand Stade of Casablanca",
    "image": "http://stadiumdb.com/pic-projects/grand_stade_de_casablanca/grand_stade_de_casablanca05.jpg",
    "location": "Casablanca",
    "description": "The grand Stade of Casablanca will be a stadium in Casablanca,Morocco ",
    "capacity": 93000,
    "opened": "2030",
    "country": "Morocco",
    "details": "The first concrete plans for the construction of a new, large stadium in Casablanca were made in the early 2000s, on the occasion of Morocco's bid to host the 2010 World Cup. However, in the vote held on May 15, 2004, South Africa's bid was assessed better. The new stadium was planned for the Sidi Moumen district with a capacity of 95,000 spectators. After the failure of Morocco's bid, the project was not realized, and subsequent plans reduced the capacity to 70,000 spectators, with an estimated cost of more than 2 billion dirhams.\n\nIn 2010, a new concept reminiscent of the desert rose was prepared by the French bureau SCAU. An architectural competition was held in 2011, won by the vision of the Space Group consortium from Norway and the local Belahmer Said. None of the new designs lived to see realization.\n\nAnother concept emerged in 2018, on the occasion of Morocco's bid to host the 2026 World Cup. The project was prepared by Spain's Cruz y Ortiz Arquitectos, with a proposed capacity of 93,000 spectators. However, Morocco lost the bid, and the project remained in the planning stages.\n\nWith Morocco being awarded the role of co-host of the 2030 World Cup, the construction of a new stadium in Casablanca is almost certain. Discussions about the striking design created in 2018 by Cruz y Ortiz Arquitectos continue, but a new concept might be prepared for the 2030 World Cup. Claims suggest the venue should be larger, accommodating 113,000 spectators."
  },
  {
    "id": 7,
    "name": "Estádio do Dragão",
    "image": "http://stadiumdb.com/pictures/stadiums/por/estadio_do_dragao/estadio_do_dragao13.jpg",
    "location": "Porto",
    "description": "Estádio do Dragão is the home stadium of FC Porto, located in Porto, Portugal.",
    "capacity": 50033,
    "opened": "2003",
    "country": "Portugal",
    "details": "Successor of the famous Das Antas didn't carry the same name, though it was among the options discussed before opening. Eventually, Estádio do Dragão (Dragon Stadium) won the vote, celebrating the creature from FC Porto's crest. The club had arguments for it, being the major investor of the building. Of €98m invested, only €18.5m was subsidized by the government ahead of Euro 2004.\n\nConstruction brought tensions between Porto's mayor and club president, resulting in works being halted several times. Still, the contractors managed to deliver it on time, 7 months before Euro 2004. Inaugural game between FC Porto and Barcelona brought a record crowd, unbeaten to this day and even higher than the capacity, a number rarely seen in modern venues.\n\nDuring Euro 2004, the opening game took place here, as well as three group fixtures and one semifinal."
  },
  {
    "id": 8,
    "name": "Estádio José Alvalade XXI",
    "image": "http://stadiumdb.com/pictures/stadiums/por/estadio_jose_alvalade/estadio_jose_alvalade56.jpg",
    "location": "Lisbon",
    "description": "Estádio José Alvalade XXI is the home stadium of Sporting CP, located in Lisbon, Portugal.",
    "capacity": 50095,
    "opened": "2003",
    "country": "Portugal",
    "details": "Second largest stadium in Lisbon and third in Portugal was built in August 2003 ahead of the European Championship of 2004. The tournament was a chance to receive public support for the redevelopment of the old José Alvalade stadium. A completely new venue was built neighboring the old one. Designed by Portuguese Tomás Taveira, an architect known for lively and colorful stadiums, the new venue celebrates club colors and also bears the name of Alvalade, with the XXI suffix reminding that it continues a previous history.\n\nApart from seats for over 50,000 people and 1,600 parking bays, it hosts extensive infrastructure, including a conference center, supermarket, club offices, and is home to several other entities.\n\nIn 2004, four games of the European Championships were played here, and just a year later, the UEFA Cup final was also hosted by Alvalade, with Sporting – the stadium's owner – reaching the final and losing against CSKA Moscow. Portugal's national side also played several fixtures here."
  },
  {
    "id": 9,
    "name": "Estádio da Luz",
    "image": "http://stadiumdb.com/pictures/stadiums/por/estadio_da_luz/estadio_da_luz45.jpg",
    "location": "Lisbon",
    "description": "Estádio da Luz is the home stadium of SL Benfica, located in Lisbon, Portugal.",
    "capacity": 64642,
    "opened": "2003",
    "country": "Portugal",
    "details": "The ground was built just adjacent to the former home of Benfica that used to stand there since 1954. Investment was prompted by Portugal hosting Euro 2004 and requiring extensive investment in infrastructure. Its common name, Estádio da Luz, refers to the neighborhood of Luz in which it stands. Fans also refer to it as A Catedral (The Cathedral) – both names inherited after its predecessor, one of Europe's largest venues back in the days.\n\nConstruction cost close to €120m and was done along the design by Populous (back then HOK Sport). Interestingly, Benfica stands among very few clubs in Portugal that financed their own stadium. Although the size proved to be large in the first decade, the club has been doing well attracting crowds. Record attendance of the inaugural match still stands, though.\n\nThe venue is famous for Benfica's unusual mascot, an eagle that flies over the pitch before each fixture. Thanks to its location in Lisbon and the largest capacity in Portugal, it was the Euro 2004 final venue and the place of numerous Portugal international games. In 2007, a new list of Seven Wonders was announced here and UEFA chose da Luz as the location of the 2014 Champions League final."
  },
  {
    "id": 10,
    "name": "Estadio Metropolitano",
    "image": "http://stadiumdb.com/pictures/stadiums/esp/estadio_metropolitano/estadio_metropolitano10.jpg",
    "location": "Madrid",
    "description": "Estadio Metropolitano is the home stadium of Atlético Madrid, located in Madrid, Spain.",
    "capacity": 68456,
    "opened": "2017",
    "country": "Spain",
    "details": "The story of Atletico's new stadium began a long, long time ago, back in 1988. Back then the competition for the design of Madrid's largest athletic stadium was carried out. By late 1993, the 20,000-capacity venue was ready and it offered two distinctive features.\n\nFirst, all of the capacity was accumulated within the west side, spread across two tiers. Second, the comb-alike concrete facade earned it the nickname La Peineta, which was in use for many years. Indeed, the rough concrete walls with rhythmic openings stood out.\n\nWhile impressive and built with high hopes, the stadium proved to have little use. Hosting events only incidentally, it saw its first major international athletic meeting in 2002, after 8 years in operation. Days of glory were expected to come later, with Madrid consequently bidding to host the Olympics in 2012, 2016, and 2020 only to see all three bids fall through.\n\nAfter the painful failures only one key element of the Olympic dream remained: making the stadium into a truly iconic structure. Back when the 2nd Olympic bid was still in play, the city of Madrid and Atletico agreed that the city would relocate here and, should the Olympics be granted, allow for a temporary conversion to Olympic mode. For Atleti, the stadium was a lucrative move with its main stand ready, convenient access, and good public transport beside the eastern ring-road.\n\nDesign work was carried out, as it had been from the start in 1988, by Cruz y Ortiz. To reconfigure a track and field stadium into a football-only layout they dug the field further into the ground, resulting in it being sunken 15 meters below ground level. The semi-rectangular lowermost tier is visibly flat but what the architects achieved was better distance between the first row and players than at Vicente Calderón. The field is just 6-9 meters away, even if the distance grows significantly with every row and is quite long for fans in the upper ring.\n\nDue to the vast space taken by the previously-athletic stadium and efforts to put fans as close as possible, the auditorium is very spacious. This caused the roof to cover 96% (instead of the preferred 100%) of fans. At the same time, such a layout offered an immense amount of floor space beneath ground level, used to hold 1,035 parking spaces on two levels. Outside the stadium, further 3,000 cars can find their spot on matchdays.\n\nWith two floors used for parking, the stadium still offers up to 5 levels for other uses, creating great infrastructure for one of Spain's most extensive corporate hospitality offers. Within the newly-built grandstands, there's a long strip of 94 skyboxes, while further premium seats were installed within the main stand.\n\nThe entire stadium is topped by a masterpiece of engineering and a key architectural feature: the crown. We could call it a roof but that seems a bit modest. On the one hand, this gently undulating cover softens Metropolitano's otherwise concrete form, keeping its height relatively low (between 32 and 42 meters) in order not to disrupt the landscape. On the other, the design provides a stunning impression inside, where 96 PTFE segments resemble origami artwork.\n\nThough its overall surface is just 46,500 m2, the roof actually uses 83,000 m2 of PTFE due to the way it's formed. It seems very fitting that the roof has vibrant nighttime illumination, allowing it to come alive on matchdays."
  },
  {
    "id": 11,
    "name": "Estadio Santiago Bernabéu",
    "image": "http://stadiumdb.com/pic-buildings/esp/santiago_bernabeu/santiago_bernabeu994.jpg",
    "location": "Madrid",
    "description": "Estadio Santiago Bernabéu is the home stadium of Real Madrid, located in Madrid, Spain.",
    "capacity": 81044,
    "opened": "1947",
    "country": "Spain",
    "details": "The concept was first presented in October 2012, when Real Madrid announced four finalists of the international design competition for Santiago Bernabeu. In January 2014, the vision by GMP Architekten, L35 Arquitectos and Ribas&Ribas was declared the final one, set for implementation.\n\nThe plan initially included additional premium seating across the stadium, mostly in the western part. The east side is also to get a new regular tier of seats. A vast commercial building was to adjoin the western facade, while all of the stadium will receive a new external wrap. The metallic cladding will form a futuristic and asymmetric form with LED lighting illumination.\n\nEventually, however, after over two years of bureaucratic deadlock, the stadium plan was downsized significantly. Capacity increase was scrapped, so were the hotel, shopping center, and additional parking spaces.\n\nThe stadium will receive a brand new roof structure with a retractable central part. The inner perimeter of the roof will be covered by a panoramic giant screen."
  },
  {
    "id": 12,
    "name": "Camp Nou",
    "image": "http://stadiumdb.com/pic-buildings/esp/camp_nou/camp_nou071.jpg",
    "location": "Barcelona",
    "description": "Camp Nou is the home stadium of FC Barcelona, located in Barcelona, Spain.",
    "capacity": 99354,
    "opened": "1957",
    "country": "Spain",
    "details": "Camp Nou opened on September 24, 1957, as the seventh stadium in FC Barcelona's history. Initially, the venue had two levels of stands. Between 1980 and 1982, before the Spanish World Cup, the auditorium was extended with a third tier. Between 1993 and 1994, the lower ring was rebuilt, and the pitch was lowered. The last standing areas were also removed.\n\nIn this form, the facility has remained to this day, although minor renovations and modernisations have been carried out on it. With a capacity of 99,354 spectators, it is the largest stadium in Europe and ranks among the world's top in this respect. At the same time, FC Barcelona is one of the most recognisable football clubs with a worldwide fan base, so it is not surprising that since the beginning of the 21st century there have been plans to expand Camp Nou once again."
  },
  {
    "id": 13,
    "name": "San Mamés Barria",
    "image": "http://stadiony.net/pictures/stadiums/esp/san_mames_barria/san_mames_barria33.jpg",
    "location": "Bilbao",
    "description": "San Mamés Barria is the home stadium of Athletic Bilbao, located in Bilbao, Spain.",
    "capacity": 53331,
    "opened": "2013",
    "country": "Spain",
    "details": "Construction of Athletic Bilbao's new stadium just several meters from the old San Mames began in spring of 2010. The project was divided into two phases: three stands and the pitch came in first, while the last southern stand was to be built only after the old stadium is demolished due to lack of space and the need to have a stadium for Primera División throughout the process.\n\nInitial renderings of the Cesar Azkarate vision came as soon as in 2006. Back then, the external design was still unclear, while the interior was planned as three proportional tiers. Eventually, that seating layout was dropped for two large tiers with a minor business ring between them. What came as a connection with the old stadium were steep stands strictly surrounding the pitch.\n\nThe external cladding was eventually chosen to consist of thousands of white baleens, each gnarled to create an interesting visual effect, but also to allow sunlight and ventilation inside. Also, what makes this stadium stand out from most modern venues, almost all of the concrete megastructure visible inside was colored with black and red paint, completing Athletic's traditional colors with the white cladding.\n\nThe appealing aesthetics earned the new San Mames several international titles in architectural competitions, while three years into its operation it became the first Spanish stadium to be LEED-certified.\n\nAthletic played their first game on September 16, 2013, facing Celta Vigo in Primera División. 100 years after the original San Mames opened, there were 36,000 people present, over ten times the attendance from 1913. The second phase (south stand) was delivered in September 2014, making the stadium one of the largest throughout Primera División.\n\nIt's a unique case of a stadium to be upgraded just three years into its operation. Soon after opening, some supporters began complaining that rainwater impacted front rows due to wind, even despite the roof covering more space than expected by international guidelines. 7,000 square meters of cable roof with transparent ETFE cladding was added, making it the most opaque stadium in Spain."
  },
  {
    "id": 14,
    "name": "Estadio Olímpico de Sevilla",
    "image": "http://stadiony.net/pictures/stadiums/esp/la_cartuja/la_cartuja32.jpg",
    "location": "Seville",
    "description": "Estadio Olímpico de Sevilla is a multi-purpose stadium located in Seville, Spain.",
    "capacity": 57619,
    "opened": "1999",
    "country": "Spain",
    "details": "Planned and built for the 2004 Olympics, which weren't eventually granted to Seville, but Athens. That's why the stadium standing on the La Cartuja island is called 'Olympic' by authorities.\n\nBuilt for €120 million, it never signed an anchor tenant, only occasionally hosting games of Sevilla, Betis, or the national team (however, only friendlies). To fill the calendar, it hosted several finals, two domestic (1999, 2001), and one of the UEFA Cup (2003), as well as athletic championships. It also serves as a venue for the tennis Davis Cup.\n\nThe ground also served as a venue for large concerts, with the likes of Madonna or U2 performing.\n\nThe simple and harmonious design was done by Spain's renowned architects Cruz y Ortiz, who designed stands of various height and layout to accommodate under 60,000 people."
  },
  {
    "id": 15,
    "name": "El Molinón",
    "image": "http://stadiony.net/pictures/stadiums/esp/el_molinon/el_molinon09.jpg",
    "location": "Gijón",
    "description": "El Molinón is the home stadium of Sporting Gijón, located in Gijón, Spain.",
    "capacity": 30000,
    "opened": "1908",
    "country": "Spain",
    "details": "Though surely not the largest, in terms of history, this ground is a leader in Spain. First information of its existence comes from 1908, but the game from May 20th described in chronicles was surely not the first one played at El Molinón. Therefore, Gijón's stadium is the oldest functioning professional ground in Spain, even though Sporting itself started playing here in 1915.\n\nIn terms of major events, it can also match some of the most legendary Spanish stadia. It hosted 3 games of the 1982 World Cup, 12 matches of the national team, and 1920 Copa del Rey final between Barcelona and Athletic Bilbao. Then come the concerts of the world's biggest stars with the likes of Tina Turner, Bon Jovi, or Sting opening the list. And in 1970 one more historical fact was made here when Sporting's game against Osasuna Pamplona was the first 2nd league match to be televised in Spain.\n\nIts original name derives from an old mill (Spanish: molino) that used to stand here before the stadiums were built. The mill was owned by an Englishman and English is also the ground's style. It's been football-specific with independent stands, as most stadiums in England are thought to be, not mentioning the important fact of El Molinón being the very first ground in Spain to have all stands covered (1969). The best days for Sporting's home were, however, in the 80s after extensive revamp took place prior to the World Cup, and the attendance record of 43,000 was achieved during the West Germany – Austria game, never beaten afterward.\n\nIn the late '90s, safety regulations forced all stands to be converted into individual seating, making capacity fall to just over 25,000. Thankfully, the ground, which was in desperate need of modernization, got some of its former glory back in 2009-11 when the north stand received a second tier, and the whole stadium was covered in new, elegant 'wrapping'."
  },
  {
    "id": 16,
    "name": "La Rosaleda",
    "image": "http://stadiumdb.com/pic-projects/estadio_la_rosaleda/estadio_la_rosaleda04.jpg",
    "location": "Malaga",
    "description": "La Rosaleda is the home stadium of Málaga CF, located in Malaga, Spain.",
    "capacity": 45000,
    "opened": "1941",
    "country": "Spain",
    "details": "Estadio La Rosaleda in Málaga was opened in 1941. The facility serves the players of Málaga CF on a daily basis. Amongst other things, the stadium played host to World Cup matches in 1982. The last major modernisation took place between 2000 and 2006, when it was rebuilt stand by stand.\n\nFollowing Spain's candidature (along with Portugal and Morocco) to host the 2030 World Cup, the stadium's owners (who are the city, provincial, and regional authorities) took the initiative to include the Malaga stadium in this candidature. On March 31, 2023, the concept for the expansion of the arena, which was created by architects from Morph Estudio, was officially presented at the city hall.\n\nAs the stadium is too small in view of FIFA's requirements to host World Cup matches, the project involves increasing the capacity from the current ca. 30,000 to 45,000 spectators. The concept also calls for the demolition of the structures adjacent to the stands on the outside, the addition of a third tier to the stands, the creation of an attractive façade, the full roofing of the auditorium, and the addition of an annex behind the north stand to replace the auxiliary pitch.\n\nA hotel and commercial spaces are to be part of the project. The facility should be vibrant at all times so that it can generate revenue or at least not make a loss. An interesting amenity is to be a promenade along the top of the stadium, available to the public on a daily basis. As part of the investment, revitalisation of the immediate surroundings is also planned.\n\nThe project is expected to take two to three years to complete. During the works, the facility is expected to remain functional, although parts of the stands will have to be temporarily taken out of use. The modernisation is expected to cost between €70 million and €120 million. The costs will be split equally between the city, provincial, and regional authorities, but a hotel chain that decides to participate in the project is also expected to contribute to the funding.\n\nOn October 11, 2023, FIFA officially announced the choice of hosts for the 2030 World Cup, with Spain, Portugal, and Morocco winning the bid, also joined by Uruguay, Argentina, and Paraguay, where one game each will be played at the start of the tournament.\n\nThe Malaga stadium is on the list of 15 pre-selected venues from Spain to host the championship matches, but this list will most likely be reduced to 10 or 11 (the final selection of venues is expected in the summer of 2024). Although the impetus for the extension of Estadio La Rosaleda was the prospect of hosting the World Cup matches, the initiators assure that the investment will be made regardless of whether Málaga falls as one of the host cities."
  },
  {
    "id": 17,
    "name": "Nueva Romareda",
    "image": "http://stadiumdb.com/pic-projects/nuevo_estadio_de_la_romareda/nuevo_estadio_de_la_romareda01.jpg",
    "location": "Zaragoza",
    "description": "Nueva Romareda is the home stadium of Real Zaragoza, located in Zaragoza, Spain.",
    "capacity": 42500,
    "opened": "1957",
    "country": "Spain",
    "details": "La Romareda Stadium was inaugurated in 1957 and, although it has undergone various modernisations over the years, it has still retained much of its original form. It was planned to be rebuilt for Euro 2004, but Portugal's bid to host the tournament won. In the years that followed, there were further proposals and designs, but none were realised. In addition to the redevelopment of La Romareda, the possibility of building a new stadium in a different location was also discussed.\n\nFurther reports on Real Zaragoza's stadium emerged in 2022, at which time the possibility of building the facility in another location was finally rejected and the city announced a competition for the long-term lease of La Romareda. The future tenant was also expected to submit a redevelopment plan for the stadium so that it could join the bidding process to host the 2030 World Cup. It was, of course, expected that Real would enter the tender.\n\nReal Zaragoza hired renowned architectural firm IDOM to draw up plans for the new La Romareda. The office's portfolio includes work on the design of the new San Mamés or Camp Nou redevelopment. The first renderings of the new arena were made public on May 12, 2023.\n\nThe concept developed by IDOM calls for a completely new stadium to replace the existing La Romareda. The facility is to have a football-specific layout and will accommodate 42,500 spectators. The stands will surround the pitch on all sides and will be divided into two tiers, with additional narrow tiers along the pitch.\n\nThe facility will include premium seating and skyboxes, as well as wheelchair spaces. Two video screens will be suspended above the stands behind the goals. Inside the stands there will be usable areas, and the whole will be given a unified, coherent form.\n\nInspired by the cool northerly winds that blow in the area (the so-called cierzo), the designers have given the rectangular shape a somewhat dynamic character, using subtle reliefs and concaves. The building will be covered by a lightweight roof, which will shield not only all the seats in the auditorium, but also the viewing terrace surrounding the stands. The dominant colours in the stadium are to be Real Zaragoza's club colours, blue and white.\n\nThe stadium is to be equipped with the latest technology and follow sustainable concepts. The arena will be equipped to host top-level football competitions. In addition to football matches, it is also to host other events, both sporting and non-sporting. The facility is to become a new showcase not only for the club, but also for the city and the entire region.\n\nAccording to initial estimates, the project is expected to cost around €140 million to complete. The construction is to be financed exclusively with private funds. The work is expected to take place between 2024 and 2028 and will be carried out in stages so that Real Zaragoza can play their matches at the stadium at all times."
  },
  {
    "id": 18,
    "name": "Reale Arena",
    "image": "http://stadiony.net/pictures/stadiums/esp/anoeta/anoeta21.jpg",
    "location": "San Sebastián",
    "description": "Reale Arena is the home stadium of Real Sociedad, located in San Sebastián, Spain.",
    "capacity": 40000,
    "opened": "1993",
    "country": "Spain",
    "details": "Estadio Anoeta was built in the Amara district to replace Campo de Fútbol Municipal de Atocha opened in 1913. Exactly 80 years later, the new venue was ready for operation. The first event ever was the Junior European Championships in Athletics on July 29th. Two weeks later came the first football game between Real Sociedad and Real Madrid.\n\nThe first club played all their home games from the very opening, though in recent years they've been sharing Anoeta with two French rugby teams, for which it is the most suitable venue. Anoeta is famous for its shape with stands of different height creating a very dynamic impression. However, for many years the atmosphere within the stadium was criticized, which is not uncommon in cases where fans are as far from the field as 40 meters (front row behind goals).\n\nThe auditorium was covered, and massive concrete supports create a very distinctive exterior appearance. In comparison, the roof itself was rather lightweight, formed by a 3D steel truss spanning 15,000 m2.\n\nPlans of Anoeta's reconstruction first surfaced in 2004 when the vision of Gipuzkoarena was created, foreseeing a 40,000+ football-only stadium with a hotel, shops, and offices attached. The plan fell through, as did following attempts to buy the facility from local authorities. Finally, in 2015 a new concept was brought to light, which saw Real Sociedad fund the vast majority of the work, leaving the remainder to public entities.\n\nUpon commencement of the project in 2017, the budget was estimated to slightly exceed €47 million. Of the amount, Real Sociedad would cover €33 million, the Basque Country follows with €10m and the Gipuzkoa province ends with €4m. While the main contract stayed within this margin, it didn't include some features (seats, sound system, and several other elements, along with the stadium perimeter), which means the final price tag exceeds €50 million.\n\nCreated by renowned Basque architect Izaskun Larzabal, the concept on one hand leaves as much as possible of the old stadium, while transforming it into a modern football-specific venue. In the end, only the upper side sections were left in place, along with their roof, while the remainder is either redeveloped or built from scratch. The challenge became to reconfigure the auditorium while respecting the old stands' maximum height.\n\nThe field was thus lowered by 1.5m, both end stands were built from scratch, replacing demolished curves, while the lower sides were moved towards the field and extended thanks to the space available after the field was lowered. The outcome is shortening the distance from the field of play from 42 to 8.5 meters behind goals and from 25 to 10.5m on the sides.\n\nAt the same time, capacity grew significantly, from 32,076 to 39,500. Initial estimates gave capacity at 42,300, but optimization of hospitality areas and anticipation of some fans standing throughout games in the south end led to a reduction. Exceeding 40,000 remains possible in the future with ease, should such a need arise.\n\nThe roof is an interesting structure, utilizing the very same system as for the 1993 structure, while also adding four primary trusses on top. The interlocking trusses are 150 meters long (across the stadium) and 190 meters long (along the stadium) and provide cover for new front rows. Each truss is 10 meters tall and all have been placed atop 25-meter concrete columns, built outside the stadium.\n\nIn order to create a uniform appearance of the old and new roofs, the new one also uses a lot of metal sheets for cover but also incorporates ETFE. Translucent, white membrane covers the inner perimeter of the roof (5,800 m2). ETFE has also been used as new facade material, this time in sky blue (18,500 m2). With 25% translucency, it leaves the public concourses well lit during daytime while also providing cover from rain and wind, not uncommon in San Sebastian.\n\nAs if the project didn't already have a modest time frame of 2 years, added difficulty was the continued use of the stadium for matchdays. Demolition of the old south end began in May of 2017, while the first game was played in mid-September of 2019, leaving some areas unfinished. The south end was built during 2017/18, and the north one grew even faster, during the 2018/19 season. The busiest period was the summer of 2018, when the field was lowered, and both side stands rebuilt. Even two serious accidents on site (worker and roof segment falling down, mobile crane collapsing on the field) didn't impact the schedule in a significant manner.\n\nAlong with its reopening, Anoeta received the very first naming rights deal. Until 2025 the stadium is named Reale Arena, and the insurance provider spent some €6 million on the contract."
  },
  {
    "id": 19,
    "name": "Estadi Nou Sarrià",
    "image": "http://stadiumdb.com/pictures/stadiums/esp/estadi_cornella_el_prat/estadi_cornella_el_prat11.jpg",
    "location": "Barcelona",
    "description": "Estadi Nou Sarrià was the former home stadium of RCD Espanyol.",
    "capacity": 40000,
    "opened": "1923",
    "closed": "1997",
    "country": "Spain",
    "details": "The stadium, built as a private investment of RCD Espanyol, lies approximately 7 km South-West from their previous home, the Olympic Stadium. Location in close proximity to a major highway hub allows for good communication despite the significant distance from the center of Barcelona.\n\nIn 2002, the club acquired land for the venue, having paid around €360,000. Construction started in 2003 according to the design by Reid Fenwick Asociados and took a long period of 6 years. Officially opened on June 5th, the ground hosted its first game in August and league fixtures since September 2009. The investment was planned with a budget of €60 million but turned out to be more expensive, reaching €75 million.\n\nThanks to its ecological solutions (low energy and water consumption, production of solar energy), it received the prestigious Stadium Business Award in 2010 for the best new ground opened globally. Various uses for stadium infrastructure were also given credit with a rare feature of hosting a cemetery for supporters in one of the corners.\n\nApart from Espanyol games, it was the place of the Black Eyed Peas Barcelona concert (2010) and a friendly between Chile and Mexico (2011)."
  },
  {
    "id": 20,
    "name": "Estadio de Gran Canaria",
    "image": "http://stadiumdb.com/pic-projects/estadio_gran_canaria/estadio_gran_canaria01.jpg",
    "location": "Las Palmas",
    "description": "Estadio de Gran Canaria is the home stadium of UD Las Palmas, located in Las Palmas, Spain.",
    "capacity": 44462,
    "opened": "2003",
    "country": "Spain",
    "details": "Estadio de Gran Canaria in Las Palmas was inaugurated on May 8, 2003, and was initially a facility with an athletics track. Between 2014 and 2016, the arena was modernized, removing the running track and bringing the stands closer to the pitch. With a capacity of 32,400 spectators, it is the largest stadium in the Canary Islands.\n\nThe next redevelopment of Estadio de Gran Canaria is planned to join the initiative to host the 2030 World Cup. Spain intends to bid to host the World Cup together with Portugal, Morocco, and Ukraine. To host World Cup matches, the venue would need to be expanded to a capacity of at least 40,000 spectators.\n\nOn May 18, 2023, the stadium was visited by a committee assessing the preparation of individual cities and venues for the possible hosting of the World Cup. On May 25, 2023, the president of the council (cabildo) that governs the island of Gran Canaria presented the first renderings to the wider public, showing how the stadium is planned to be redeveloped. Details of the timetable and financing are not yet known.\n\nEstadio de Gran Canaria redevelopment project involves extending the northern arch (Grada Naciente) so that it is level with the rest of the auditorium. The stands will then form a compact, enclosed oval around the pitch. An additional, low-rise spectator ring will then be added at the top (with the exception of the main stand, where a building with boxes already extends along the upper edge). The stadium will also receive a new roof over all stands, merging into one with the facade.\n\nThe upgrade is intended to complement the 2014-2016 redevelopment, and the project will give the arena a more coherent and modern look. The capacity of the stands will increase to 44,462 spectators, allowing the venue to compete for entry into the 2030 World Cup host cities. The extension will also create better conditions for club UD Las Palmas, which secured promotion to the LaLiga competition two days after the presentation of the design."
  },
  {
    "id": 21,
    "name": "Estadio Nueva Condomina",
    "image": "http://stadiony.net/pictures/stadiums/esp/nueva_condomina/nueva_condomina06.jpg",
    "location": "Murcia",
    "description": "Estadio Nueva Condomina is the home stadium of Real Murcia, located in Murcia, Spain.",
    "capacity": 33045,
    "opened": "2006",
    "country": "Spain",
    "details": "Estadio Enrique Roca de Murcia, initially called Estadio Nueva Condomina, replaced Murcia's old Estadio La Condomina, located in Murcia's city centre.\n\nThe stadium officially opened on 11 October 2006 with a friendly between Spain and Argentina (2-1). The first goal was scored by Xavi.\n\nEstadio Nueva Condomina was one of the venues selected to host matches in Spain's 2018 World Cup bid, which would have meant an increase in capacity to 43,000 seats, but the bid failed to get selected.\n\nThe stadium is also occasionally used for matches of the Spanish national team.\n\nEstadio Nueva Condomina changed name in 2019 to Estadio Enrique Roca de Murcia following a naming rights sponsorship deal."
  },
  {
    "id": 22,
    "name": "Nou Mestalla",
    "image": "http://stadiumdb.com/pic-projects/nou_mestalla/nou_mestalla26.jpg",
    "location": "Valencia",
    "description": "Nou Mestalla is the planned new home stadium of Valencia CF, located in Valencia, Spain.",
    "capacity": 70000,
    "scheduled_completion": "2023",
    "country": "Spain",
    "details": "The initial concept for the new stadium along Avenida de les Corts Valencianes was presented in 2006 by renowned architect Mark Fenwick. Spain's most impressive stadium plan at that time comprised amazing facades cut with glass surfaces, symbolically resembling the city's division into districts. Inside three tiers of seating were planned, offering 73,200 seats in total.\n\nThe project was priced at €344 million and saw groundbreaking in the summer of 2007. Initially, work was expected to end in May 2009, but by March only the main concrete structure was ready and proved to be the last phase for years. Valencia CF suffered from heavy debt and couldn't afford the remaining works.\n\nDespite many attempts to restart the project, no progress was done until late 2013. That's when the project was updated, adjusted to difficult financial conditions. Overall cost was cut to just €200 million through simplified facades, roof covering 75% of fans instead of 100%, and capacity downscaled to 61,500.\n\nIn 2017, another, even more trimmed-down concept was presented. The compact facade was abandoned as a cost-saving measure. The updated vision envisaged a facade covered only with mesh, composites, and glass.\n\nThe roof was also rethought, and this time it was to be made more economically, using wire rope technology and based on a structure independent of the stands' structure. The cost of completing the arena according to the new design was estimated to be around €100 million. Ultimately, this vision could not be implemented as well.\n\nIn 2021 there was another opportunity to complete the investment in the form of additional funding available through LaLiga's agreement with CVC Capital Partners. In June 2022, yet another concept for the completion of the Nou Mestalla was presented. This time, the venue's exterior is to be finished with an airy, terraced facade, while the tiered roof will be covered from above with photovoltaic panels, creating the largest canopy of its kind in Europe."
  }
]
